{"userDefinedMetadata": {"signature": {"outputs": {"140": {"name": "140"}}}}, "generatedBy": "1.15.0", "format": "graph-model", "weightsManifest": [{"weights": [{"name": "random_normal/shape", "dtype": "int32", "shape": [3]}, {"name": "Const", "dtype": "int32", "shape": [3]}, {"name": "Const_1", "dtype": "int32", "shape": [3]}, {"name": "transpose/perm", "dtype": "int32", "shape": [3]}, {"name": "concat_10", "dtype": "float32", "shape": [2, 128, 5]}, {"name": "concat_11", "dtype": "float32", "shape": [2, 128, 32]}, {"name": "concat_12", "dtype": "float32", "shape": [2, 256]}, {"name": "Const_51", "dtype": "int32", "shape": [3]}, {"name": "LSTM_0577a816/strided_slice/stack", "dtype": "int32", "shape": [1]}, {"name": "LSTM_0577a816/strided_slice/stack_1", "dtype": "int32", "shape": [1]}, {"name": "LSTM_0577a816/strided_slice_2/stack_1", "dtype": "int32", "shape": [1]}, {"name": "LSTM_0577a816/bidirectional_rnn/fw/fw/strided_slice", "dtype": "int32", "shape": []}, {"name": "transpose_5", "dtype": "float32", "shape": [992, 128]}, {"name": "LSTM_743f24f3/bidirectional_rnn/bw/bw/TensorArrayV2Stack/TensorListStack/element_shape", "dtype": "int32", "shape": [2]}, {"name": "LSTM_0577a816/bidirectional_rnn/fw/fw/time", "dtype": "int32", "shape": []}, {"name": "mul_3", "dtype": "float32", "shape": [128]}, {"name": "LSTM_0577a816/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorListFromTensor/element_shape", "dtype": "int32", "shape": [2]}, {"name": "transpose_6", "dtype": "float32", "shape": [128, 6]}, {"name": "mul_5", "dtype": "float32", "shape": [6]}, {"name": "ExpandDims_22/dim", "dtype": "int32", "shape": []}, {"name": "transpose_2/perm", "dtype": "int32", "shape": [4]}, {"name": "Const_108", "dtype": "int32", "shape": [3]}, {"name": "Squeeze_1", "dtype": "int32", "shape": [2]}, {"name": "GatherV2_1", "dtype": "int32", "shape": [2]}, {"name": "Cast_1", "dtype": "int32", "shape": [1]}, {"name": "SparseToDense_1/default_value", "dtype": "int32", "shape": []}, {"name": "transpose_3/perm", "dtype": "int32", "shape": [3]}, {"name": "Const_110", "dtype": "int32", "shape": [3]}, {"name": "Const_111", "dtype": "int32", "shape": [3]}, {"name": "Const_112", "dtype": "int32", "shape": [3]}, {"name": "Const_113", "dtype": "int32", "shape": [3]}, {"name": "concat_26", "dtype": "float32", "shape": [2, 128, 64]}, {"name": "concat_27", "dtype": "float32", "shape": [2, 128, 32]}, {"name": "concat_28", "dtype": "float32", "shape": [2, 256]}, {"name": "Const_104", "dtype": "int32", "shape": [3]}, {"name": "transpose_4", "dtype": "float32", "shape": [3, 32]}, {"name": "LSTM_743f24f3/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorListFromTensor/element_shape", "dtype": "int32", "shape": [2]}, {"name": "mul_1", "dtype": "float32", "shape": [32]}, {"name": "Reshape_2/shape", "dtype": "int32", "shape": [2]}], "paths": ["group1-shard1of1.bin"]}], "modelTopology": {"node": [{"attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "8"}, {"size": "15"}]}}}, "name": "observation", "op": "Placeholder"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "random_normal/shape", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "Const", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "Const_1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "transpose/perm", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "128"}, {"size": "5"}]}}}}, "name": "concat_10", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "128"}, {"size": "32"}]}}}}, "name": "concat_11", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "256"}]}}}}, "name": "concat_12", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "Const_51", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "LSTM_0577a816/strided_slice/stack", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "LSTM_0577a816/strided_slice/stack_1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "LSTM_0577a816/strided_slice_2/stack_1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "LSTM_0577a816/bidirectional_rnn/fw/fw/strided_slice", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "992"}, {"size": "128"}]}}}}, "name": "transpose_5", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "LSTM_743f24f3/bidirectional_rnn/bw/bw/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "LSTM_0577a816/bidirectional_rnn/fw/fw/time", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "mul_3", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "LSTM_0577a816/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "6"}]}}}}, "name": "transpose_6", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}}, "name": "mul_5", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "ExpandDims_22/dim", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}, "name": "transpose_2/perm", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "Const_108", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "Squeeze_1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "GatherV2_1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "Cast_1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}, "name": "SparseToDense_1/default_value", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "transpose_3/perm", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "Const_110", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "Const_111", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "Const_112", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "Const_113", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "128"}, {"size": "64"}]}}}}, "name": "concat_26", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "128"}, {"size": "32"}]}}}}, "name": "concat_27", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "256"}]}}}}, "name": "concat_28", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "Const_104", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "32"}]}}}}, "name": "transpose_4", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "LSTM_743f24f3/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "mul_1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "Reshape_2/shape", "op": "Const"}, {"attr": {"seed2": {"i": "0"}, "dtype": {"type": "DT_FLOAT"}, "seed": {"i": "0"}, "T": {"type": "DT_INT32"}}, "name": "random_normal/RandomStandardNormal", "input": ["random_normal/shape"], "op": "RandomStandardNormal"}, {"attr": {"seed2": {"i": "0"}, "dtype": {"type": "DT_FLOAT"}, "seed": {"i": "0"}, "T": {"type": "DT_INT32"}}, "name": "random_normal_1/RandomStandardNormal", "input": ["random_normal/shape"], "op": "RandomStandardNormal"}, {"attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "name": "Slice", "input": ["observation", "Const", "Const_1"], "op": "Slice"}, {"attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "name": "LSTM_0577a816/bidirectional_rnn/fw/fw/TensorArrayV2", "input": ["LSTM_743f24f3/bidirectional_rnn/bw/bw/TensorArrayV2Stack/TensorListStack/element_shape", "LSTM_0577a816/bidirectional_rnn/fw/fw/strided_slice"], "op": "TensorListReserve"}, {"attr": {"T": {"type": "DT_INT64"}, "validate_indices": {"b": true}, "Tindices": {"type": "DT_INT64"}}, "name": "SparseToDense_1", "input": ["Squeeze_1", "Cast_1", "GatherV2_1", "SparseToDense_1/default_value"], "op": "SparseToDense"}, {"attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "name": "Slice_53", "input": ["observation", "Const_110", "Const_111"], "op": "Slice"}, {"attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "name": "Slice_25", "input": ["random_normal/RandomStandardNormal", "Const", "Const_51"], "op": "Slice"}, {"attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "name": "Slice_51", "input": ["random_normal/RandomStandardNormal", "Const_104", "Const_51"], "op": "Slice"}, {"attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "name": "Slice_26", "input": ["random_normal_1/RandomStandardNormal", "Const", "Const_51"], "op": "Slice"}, {"attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "name": "Slice_52", "input": ["random_normal_1/RandomStandardNormal", "Const_104", "Const_51"], "op": "Slice"}, {"attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "transpose", "input": ["Slice", "transpose/perm"], "op": "Transpose"}, {"attr": {"T": {"type": "DT_INT64"}}, "name": "add_1", "input": ["Const_108", "SparseToDense_1"], "op": "AddV2"}, {"attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "name": "Slice_54", "input": ["Slice_53", "Const_112", "Const_113"], "op": "Slice"}, {"attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "name": "LSTM_0577a816/strided_slice_1", "input": ["Slice_25", "LSTM_0577a816/strided_slice/stack", "LSTM_0577a816/strided_slice/stack_1", "LSTM_0577a816/strided_slice/stack_1"], "op": "StridedSlice"}, {"attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "name": "LSTM_0577a816/strided_slice_3", "input": ["Slice_25", "LSTM_0577a816/strided_slice/stack_1", "LSTM_0577a816/strided_slice_2/stack_1", "LSTM_0577a816/strided_slice/stack_1"], "op": "StridedSlice"}, {"attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "LSTM_743f24f3/strided_slice_1", "input": ["Slice_51", "LSTM_0577a816/strided_slice/stack", "LSTM_0577a816/strided_slice/stack_1", "LSTM_0577a816/strided_slice/stack_1"], "op": "StridedSlice"}, {"attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "LSTM_743f24f3/strided_slice_3", "input": ["Slice_51", "LSTM_0577a816/strided_slice/stack_1", "LSTM_0577a816/strided_slice_2/stack_1", "LSTM_0577a816/strided_slice/stack_1"], "op": "StridedSlice"}, {"attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "LSTM_0577a816/strided_slice", "input": ["Slice_26", "LSTM_0577a816/strided_slice/stack", "LSTM_0577a816/strided_slice/stack_1", "LSTM_0577a816/strided_slice/stack_1"], "op": "StridedSlice"}, {"attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "LSTM_0577a816/strided_slice_2", "input": ["Slice_26", "LSTM_0577a816/strided_slice/stack_1", "LSTM_0577a816/strided_slice_2/stack_1", "LSTM_0577a816/strided_slice/stack_1"], "op": "StridedSlice"}, {"attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "name": "LSTM_743f24f3/strided_slice", "input": ["Slice_52", "LSTM_0577a816/strided_slice/stack", "LSTM_0577a816/strided_slice/stack_1", "LSTM_0577a816/strided_slice/stack_1"], "op": "StridedSlice"}, {"attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "name": "LSTM_743f24f3/strided_slice_2", "input": ["Slice_52", "LSTM_0577a816/strided_slice/stack_1", "LSTM_0577a816/strided_slice_2/stack_1", "LSTM_0577a816/strided_slice/stack_1"], "op": "StridedSlice"}, {"attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "LSTM_0577a816/bidirectional_rnn/bw/ReverseV2", "input": ["transpose", "LSTM_0577a816/strided_slice/stack"], "op": "ReverseV2"}, {"attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "name": "LSTM_0577a816/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorListFromTensor", "input": ["transpose", "LSTM_0577a816/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorListFromTensor/element_shape"], "op": "TensorListFromTensor"}, {"attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}, "name": "Squeeze_2", "input": ["Slice_54"], "op": "Squeeze"}, {"attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "name": "LSTM_0577a816/bidirectional_rnn/bw/bw/TensorArrayUnstack/TensorListFromTensor", "input": ["LSTM_0577a816/bidirectional_rnn/bw/ReverseV2", "LSTM_0577a816/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorListFromTensor/element_shape"], "op": "TensorListFromTensor"}, {"attr": {"output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "1"}, {"size": "32"}]}, {"dim": [{"size": "1"}, {"size": "32"}]}, {}, {}, {"dim": [{"size": "2"}, {"size": "128"}, {"size": "5"}]}, {"dim": [{"size": "2"}, {"size": "128"}, {"size": "32"}]}, {"dim": [{"size": "2"}, {"size": "256"}]}]}}, "parallel_iterations": {"i": "32"}, "_num_original_outputs": {"i": "11"}, "cond": {"func": {"name": "LSTM_0577a816_bidirectional_rnn_fw_fw_while_cond_194"}}, "body": {"func": {"name": "LSTM_0577a816_bidirectional_rnn_fw_fw_while_body_195"}}, "_lower_using_switch_merge": {"b": true}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}}, "name": "LSTM_0577a816/bidirectional_rnn/fw/fw/while", "input": ["LSTM_0577a816/bidirectional_rnn/fw/fw/time", "LSTM_0577a816/bidirectional_rnn/fw/fw/strided_slice", "LSTM_0577a816/bidirectional_rnn/fw/fw/time", "LSTM_0577a816/bidirectional_rnn/fw/fw/TensorArrayV2", "LSTM_0577a816/strided_slice", "LSTM_0577a816/strided_slice_1", "LSTM_0577a816/bidirectional_rnn/fw/fw/strided_slice", "LSTM_0577a816/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorListFromTensor", "concat_10", "concat_11", "concat_12"], "op": "StatelessWhile"}, {"device": "/device:CPU:0", "name": "MatMul", "input": ["Squeeze_2", "transpose_4"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "op": "MatMul"}, {"attr": {"output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "1"}, {"size": "32"}]}, {"dim": [{"size": "1"}, {"size": "32"}]}, {}, {}, {"dim": [{"size": "2"}, {"size": "128"}, {"size": "5"}]}, {"dim": [{"size": "2"}, {"size": "128"}, {"size": "32"}]}, {"dim": [{"size": "2"}, {"size": "256"}]}]}}, "parallel_iterations": {"i": "32"}, "_num_original_outputs": {"i": "11"}, "cond": {"func": {"name": "LSTM_0577a816_bidirectional_rnn_bw_bw_while_cond_363"}}, "body": {"func": {"name": "LSTM_0577a816_bidirectional_rnn_bw_bw_while_body_364"}}, "_lower_using_switch_merge": {"b": true}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}}, "name": "LSTM_0577a816/bidirectional_rnn/bw/bw/while", "input": ["LSTM_0577a816/bidirectional_rnn/fw/fw/time", "LSTM_0577a816/bidirectional_rnn/fw/fw/strided_slice", "LSTM_0577a816/bidirectional_rnn/fw/fw/time", "LSTM_0577a816/bidirectional_rnn/fw/fw/TensorArrayV2", "LSTM_0577a816/strided_slice_2", "LSTM_0577a816/strided_slice_3", "LSTM_0577a816/bidirectional_rnn/fw/fw/strided_slice", "LSTM_0577a816/bidirectional_rnn/bw/bw/TensorArrayUnstack/TensorListFromTensor", "concat_10", "concat_11", "concat_12"], "op": "StatelessWhile"}, {"attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}, "name": "LSTM_0577a816/bidirectional_rnn/fw/fw/TensorArrayV2Stack/TensorListStack", "input": ["LSTM_0577a816/bidirectional_rnn/fw/fw/while:3", "LSTM_743f24f3/bidirectional_rnn/bw/bw/TensorArrayV2Stack/TensorListStack/element_shape"], "op": "TensorListStack"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "add_2", "input": ["MatMul", "mul_1"], "op": "AddV2"}, {"attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}, "name": "LSTM_0577a816/bidirectional_rnn/bw/bw/TensorArrayV2Stack/TensorListStack", "input": ["LSTM_0577a816/bidirectional_rnn/bw/bw/while:3", "LSTM_743f24f3/bidirectional_rnn/bw/bw/TensorArrayV2Stack/TensorListStack/element_shape"], "op": "TensorListStack"}, {"attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "ExpandDims_10", "input": ["LSTM_0577a816/bidirectional_rnn/fw/fw/TensorArrayV2Stack/TensorListStack", "ExpandDims_22/dim"], "op": "ExpandDims"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "Relu", "input": ["add_2"], "op": "Relu"}, {"attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "LSTM_0577a816/ReverseV2", "input": ["LSTM_0577a816/bidirectional_rnn/bw/bw/TensorArrayV2Stack/TensorListStack", "LSTM_0577a816/strided_slice/stack"], "op": "ReverseV2"}, {"attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "ExpandDims_11", "input": ["LSTM_0577a816/ReverseV2", "ExpandDims_22/dim"], "op": "ExpandDims"}, {"attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}, "name": "concat_15", "input": ["ExpandDims_10", "ExpandDims_11", "ExpandDims_22/dim"], "op": "ConcatV2"}, {"attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "transpose_1", "input": ["concat_15", "transpose_2/perm"], "op": "Transpose"}, {"attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}, "name": "Reshape", "input": ["transpose_1", "add_1"], "op": "Reshape"}, {"attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "LSTM_743f24f3/bidirectional_rnn/bw/ReverseV2", "input": ["Reshape", "LSTM_0577a816/strided_slice/stack"], "op": "ReverseV2"}, {"attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "name": "LSTM_743f24f3/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorListFromTensor", "input": ["Reshape", "LSTM_743f24f3/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorListFromTensor/element_shape"], "op": "TensorListFromTensor"}, {"attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "name": "LSTM_743f24f3/bidirectional_rnn/bw/bw/TensorArrayUnstack/TensorListFromTensor", "input": ["LSTM_743f24f3/bidirectional_rnn/bw/ReverseV2", "LSTM_743f24f3/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorListFromTensor/element_shape"], "op": "TensorListFromTensor"}, {"attr": {"output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "1"}, {"size": "32"}]}, {"dim": [{"size": "1"}, {"size": "32"}]}, {}, {}, {"dim": [{"size": "2"}, {"size": "128"}, {"size": "64"}]}, {"dim": [{"size": "2"}, {"size": "128"}, {"size": "32"}]}, {"dim": [{"size": "2"}, {"size": "256"}]}]}}, "parallel_iterations": {"i": "32"}, "_num_original_outputs": {"i": "11"}, "cond": {"func": {"name": "LSTM_743f24f3_bidirectional_rnn_fw_fw_while_cond_698"}}, "body": {"func": {"name": "LSTM_743f24f3_bidirectional_rnn_fw_fw_while_body_699"}}, "_lower_using_switch_merge": {"b": true}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}}, "name": "LSTM_743f24f3/bidirectional_rnn/fw/fw/while", "input": ["LSTM_0577a816/bidirectional_rnn/fw/fw/time", "LSTM_0577a816/bidirectional_rnn/fw/fw/strided_slice", "LSTM_0577a816/bidirectional_rnn/fw/fw/time", "LSTM_0577a816/bidirectional_rnn/fw/fw/TensorArrayV2", "LSTM_743f24f3/strided_slice", "LSTM_743f24f3/strided_slice_1", "LSTM_0577a816/bidirectional_rnn/fw/fw/strided_slice", "LSTM_743f24f3/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorListFromTensor", "concat_26", "concat_27", "concat_28"], "op": "StatelessWhile"}, {"attr": {"_num_original_outputs": {"i": "11"}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "1"}, {"size": "32"}]}, {"dim": [{"size": "1"}, {"size": "32"}]}, {}, {}, {"dim": [{"size": "2"}, {"size": "128"}, {"size": "64"}]}, {"dim": [{"size": "2"}, {"size": "128"}, {"size": "32"}]}, {"dim": [{"size": "2"}, {"size": "256"}]}]}}, "cond": {"func": {"name": "LSTM_743f24f3_bidirectional_rnn_bw_bw_while_cond_867"}}, "parallel_iterations": {"i": "32"}, "body": {"func": {"name": "LSTM_743f24f3_bidirectional_rnn_bw_bw_while_body_868"}}, "_lower_using_switch_merge": {"b": true}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}}, "name": "LSTM_743f24f3/bidirectional_rnn/bw/bw/while", "input": ["LSTM_0577a816/bidirectional_rnn/fw/fw/time", "LSTM_0577a816/bidirectional_rnn/fw/fw/strided_slice", "LSTM_0577a816/bidirectional_rnn/fw/fw/time", "LSTM_0577a816/bidirectional_rnn/fw/fw/TensorArrayV2", "LSTM_743f24f3/strided_slice_2", "LSTM_743f24f3/strided_slice_3", "LSTM_0577a816/bidirectional_rnn/fw/fw/strided_slice", "LSTM_743f24f3/bidirectional_rnn/bw/bw/TensorArrayUnstack/TensorListFromTensor", "concat_26", "concat_27", "concat_28"], "op": "StatelessWhile"}, {"attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}, "name": "LSTM_743f24f3/bidirectional_rnn/fw/fw/TensorArrayV2Stack/TensorListStack", "input": ["LSTM_743f24f3/bidirectional_rnn/fw/fw/while:3", "LSTM_743f24f3/bidirectional_rnn/bw/bw/TensorArrayV2Stack/TensorListStack/element_shape"], "op": "TensorListStack"}, {"attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}, "name": "LSTM_743f24f3/bidirectional_rnn/bw/bw/TensorArrayV2Stack/TensorListStack", "input": ["LSTM_743f24f3/bidirectional_rnn/bw/bw/while:3", "LSTM_743f24f3/bidirectional_rnn/bw/bw/TensorArrayV2Stack/TensorListStack/element_shape"], "op": "TensorListStack"}, {"attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "ExpandDims_22", "input": ["LSTM_743f24f3/bidirectional_rnn/fw/fw/TensorArrayV2Stack/TensorListStack", "ExpandDims_22/dim"], "op": "ExpandDims"}, {"attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "LSTM_743f24f3/ReverseV2", "input": ["LSTM_743f24f3/bidirectional_rnn/bw/bw/TensorArrayV2Stack/TensorListStack", "LSTM_0577a816/strided_slice/stack"], "op": "ReverseV2"}, {"attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "ExpandDims_23", "input": ["LSTM_743f24f3/ReverseV2", "ExpandDims_22/dim"], "op": "ExpandDims"}, {"attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}, "name": "concat_31", "input": ["ExpandDims_22", "ExpandDims_23", "ExpandDims_22/dim"], "op": "ConcatV2"}, {"attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "transpose_2", "input": ["concat_31", "transpose_2/perm"], "op": "Transpose"}, {"attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}, "name": "Reshape_1", "input": ["transpose_2", "add_1"], "op": "Reshape"}, {"attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "transpose_3", "input": ["Reshape_1", "transpose_3/perm"], "op": "Transpose"}, {"attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "Reshape_2", "input": ["transpose_3", "Reshape_2/shape"], "op": "Reshape"}, {"attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}, "name": "concat_32", "input": ["Reshape_2", "Relu", "ExpandDims_22/dim"], "op": "ConcatV2"}, {"device": "/device:CPU:0", "name": "MatMul_1", "input": ["concat_32", "transpose_5"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "op": "MatMul"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "add_3", "input": ["MatMul_1", "mul_3"], "op": "AddV2"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "Relu_1", "input": ["add_3"], "op": "Relu"}, {"device": "/device:CPU:0", "name": "MatMul_2", "input": ["Relu_1", "transpose_6"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "op": "MatMul"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "name": "140", "input": ["MatMul_2", "mul_5"], "op": "AddV2"}], "versions": {"producer": 134, "minConsumer": 12}}, "convertedBy": "TensorFlow.js Converter v1.7.2"}